# age = 0

# while age < 18:
#     print(f"Мне {age} лет. Я ребёнок")
#     age += 1
# print("Пора в качалку!")

# i = 0
# while i < 5:
#     print("Привет")
#     i += 1



# a = 1
# b = "Волтер"
# while a < 11:
#     print(a,b)
#     a += 1


# Задача №2
# price = 20
# allMoney = 110

# while allMoney >= price:
#     print("Вы купили товар")
#     allMoney -= price
#     print(f"У вас осталось {allMoney} рублей")
# print("У вас недостаточно денег на счёте")


# Задача №3
# print("Игра - Отгадай число\n")
# randomNumber = 34
# inputNumber = int(input("Угадай какое число я загадал (1-100): "))

# while randomNumber != inputNumber:
#     if randomNumber < inputNumber:
#         print("Загаданное число меньше")
#     else:
#         print("Загаданное число больше")
#     inputNumber = int(input("Попробуй ещё раз"))
# print("Ты отгадал")

# Цикл for
# for i in range(0,51):
#     print("Hello world")

# Задача №4
# summa = 0
# N = int(input("Введите число"))
# for i in range(1,N + 1):
#     summa += i
# print(summa)